ЕРПУХАстенд.cbr_Основной/src/Enums/ТипыИсполнителейЗаданийНаПеревозку/ТипыИсполнителейЗаданийНаПеревозку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="fb378302-d95b-4135-bffd-6239a0199221">
  <name>ТипыИсполнителейЗаданийНаПеревозку</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>cbr_НеУчаствуемВДоставке</name>
    <comment>//++ БаженоваЕО 02.02.2026 СКЛ.4</comment>
  </enumValues>
  <enumValues extendedConfigurationObject="a8905e3a-939f-4248-8255-c2c1f39d3143">
    <name>НашаТранспортнаяСлужба</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="d5f011ed-9752-4da4-989a-fbf936cffbff">
    <name>Перевозчик</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

ЕРПУХАстенд.cbr_Основной/src/Enums/ВидыДоставки/ВидыДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="b5ed99b2-7924-4203-a775-513d82ad12f3">
  <name>ВидыДоставки</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="5d97dd16-48c2-4724-8773-9b2adf8c2fa5">
    <name>СоСклада</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="7d4255ab-af6b-402e-a3ad-e6d0703bb735">
    <name>НаСклад</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

ЕРПУХАстенд.cbr_Основной/src/CommonModules/ЗаданиеНаПеревозкуЛокализация/Module.bsl
#Область СлужебныеПроцедурыИФункции
//++ БаженоваЕО 05.02.2026 СКЛ.4
&После("ОбработкаЗаполнения")
Процедура cbr_ОбработкаЗаполнения(Объект, ДанныеЗаполнения, СтандартнаяОбработка) Экспорт
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказКлиента") 
		ИЛИ ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		
		Объект.Дата = ТекущаяДата();
		Объект.Приоритет = Справочники.Приоритеты.НайтиПоНаименованию("Средний");
		Объект.Склад = ДанныеЗаполнения.Склад;
		Объект.Ответственный = Пользователи.ТекущийПользователь();
		Объект.ЗаданиеВыполняет	= Перечисления.ТипыИсполнителейЗаданийНаПеревозку.cbr_НеУчаствуемВДоставке;
		Объект.Статус = Перечисления.СтатусыЗаданийНаПеревозку.Формируется;
		
		Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
			Объект.Операция = Перечисления.ВидыДоставки.СоСклада;
		ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
			 Объект.Операция = Перечисления.ВидыДоставки.НаСклад;
		КонецЕсли;
		
		НоваяСтрока = Объект.Маршрут.Добавить();
		НоваяСтрока.Адрес = ДанныеЗаполнения.АдресДоставки;	
			
	КонецЕсли;
	
КонецПроцедуры //-- БаженоваЕО 05.02.2026 СКЛ.4

#КонецОбласти
